
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>什么是TypeScript · TypeSctipt 学习笔记</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="G-Dragon">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ben-di-kai-fa-huan-jing-da-jian.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    Introduction
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">简介</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="shen-me-shi-typescript.html">
            
                <a href="shen-me-shi-typescript.html">
            
                    
                        <b>2.1.</b>
                    
                    什么是TypeScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="ben-di-kai-fa-huan-jing-da-jian.html">
            
                <a href="ben-di-kai-fa-huan-jing-da-jian.html">
            
                    
                        <b>2.2.</b>
                    
                    本地开发环境搭建
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基础</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../ji-chu-1/shen-me-shi-lei-xing-jian-cha.html">
            
                <a href="../ji-chu-1/shen-me-shi-lei-xing-jian-cha.html">
            
                    
                        <b>3.1.</b>
                    
                    什么是类型检查
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../ji-chu-1/lei-xing.html">
            
                <a href="../ji-chu-1/lei-xing.html">
            
                    
                        <b>3.2.</b>
                    
                    类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../ji-chu-1/namespace.html">
            
                <a href="../ji-chu-1/namespace.html">
            
                    
                        <b>3.3.</b>
                    
                    命名空间
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="../ji-chu-1/interface.html">
            
                <a href="../ji-chu-1/interface.html">
            
                    
                        <b>3.4.</b>
                    
                    接口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="../ji-chu-1/enum.html">
            
                <a href="../ji-chu-1/enum.html">
            
                    
                        <b>3.5.</b>
                    
                    枚举
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.6" data-path="../ji-chu-1/tsconfig-json.html">
            
                <a href="../ji-chu-1/tsconfig-json.html">
            
                    
                        <b>3.6.</b>
                    
                    tsconfig.json
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.7" data-path="../ji-chu-1/define-file.html">
            
                <a href="../ji-chu-1/define-file.html">
            
                    
                        <b>3.7.</b>
                    
                    声明文件
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">进阶</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../Advance/how-ts-work.html">
            
                <a href="../Advance/how-ts-work.html">
            
                    
                        <b>4.1.</b>
                    
                    TypeScript 是怎样工作的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../Advance/ts-compile-principle.html">
            
                <a href="../Advance/ts-compile-principle.html">
            
                    
                        <b>4.2.</b>
                    
                    TypeScript 编译原理
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >什么是TypeScript</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4EC0;&#x4E48;&#x662F;-typescript">&#x4EC0;&#x4E48;&#x662F; Typescript?</h1>
<p>TypeScript &#x662F;&#x4E00;&#x79CD;&#x7531;&#x5FAE;&#x8F6F;&#x5F00;&#x53D1;&#x548C;&#x7EF4;&#x62A4;&#x7684;&#x514D;&#x8D39;&#x5F00;&#x6E90;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C; &#x7ECF;&#x8FC7;&#x4E24;&#x5E74;&#x7684;&#x5F00;&#x53D1;&#x4E8E; 2012 &#x53D1;&#x5E03;&#x3002;&#x521B;&#x5EFA;&#x5B83;&#x662F;&#x4E3A;&#x4E86;&#x5141;&#x8BB8;&#x8FDB;&#x884C;&#x53EF;&#x9009;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x8FD9;&#x5728;&#x5F00;&#x53D1;&#x5927;&#x89C4;&#x6A21;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#x7279;&#x522B;&#x6709;&#x7528;&#x3002;&#x5F53;&#x521D;&#x4E4B;&#x6240;&#x4EE5;&#x5F00;&#x53D1; TypeScript &#x8FD8;&#x662F;&#x7531;&#x4E8E;&#x5FAE;&#x8F6F;&#x5185;&#x90E8;&#x5728;&#x4F7F;&#x7528; JavaScript&#x5F00;&#x53D1;&#x5185;&#x90E8;&#x9879;&#x76EE;&#x662F;&#x9047;&#x5230;&#x7F29;&#x653E;&#x95EE;&#x9898;&#x3002;</p>
<ul>
<li>&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x7C7B;&#x578B;&#x7684; JavaScript &#x8D85;&#x96C6;&#xFF0C;&#x53EF;&#x7F16;&#x8BD1;&#x4E3A;&#x7EAF; JavaScript&#x3002;</li>
<li>&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x5E94;&#x7528;&#x7EA7; JavaScript &#x5F00;&#x53D1;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x5BF9;&#x4E8E;&#x719F;&#x6089; c#&#x3001;Java &#x548C;&#x6240;&#x6709;&#x5F3A;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;TypeScript &#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5B66;&#x4E60;&#x548C;&#x4F7F;&#x7528;&#x3002;</li>
<li>TypeScript &#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x3002;&#x5B83;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x6765;&#x7F16;&#x8BD1;&#x548C;&#x751F;&#x6210; JavaScript &#x6587;&#x4EF6;&#x3002;</li>
<li>TypeScript &#x662F;&#x5E26;&#x6709;&#x4E00;&#x4E9B;&#x9644;&#x52A0;&#x7279;&#x6027;&#x7684; ES6 JavaScript &#x7248;&#x672C;&#x3002;</li>
</ul>
<p><img src="../asserts/imgs/01.png" alt=""></p>
<p><img src="../asserts/imgs/02.png" alt=""></p>
<hr>

<h1 id="&#x4EC0;&#x4E48;&#x662F;&#x9759;&#x6001;-vs-&#x52A8;&#x6001;&#x7C7B;&#x578B;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x9759;&#x6001; Vs &#x52A8;&#x6001;&#x7C7B;&#x578B;&#xFF1F;</h1>
<h3 id="&#x9759;&#x6001;&#x7C7B;&#x578B;">&#x9759;&#x6001;&#x7C7B;&#x578B;</h3>
<p>&#x5982;C&#x3001;Java&#x7B49;&#x90FD;&#x5C5E;&#x4E8E;&#x9759;&#x6001;&#x5F3A;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x9759;&#x6001;&#x5F3A;&#x7C7B;&#x578B;&#x662F;&#x6307;&#x5728;&#x53D8;&#x91CF;&#x88AB;&#x5B9A;&#x4E49;&#x7684;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x5B83;&#x6240;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#x4E86;&#x3002;</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> name: string = <span class="hljs-string">&apos;&apos;</span>
name = <span class="hljs-number">996</span>  <span class="hljs-comment">//&#x62A5;&#x9519;</span>
</code></pre>
<h3 id="&#x52A8;&#x6001;&#x7C7B;&#x578B;">&#x52A8;&#x6001;&#x7C7B;&#x578B;</h3>
<p>&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;&#x5F31;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x4ECE;&#x5B57;&#x9762;&#x610F;&#x601D;&#x4E0A;&#x770B;&#x8FD9;&#x4E2A;&#x521A;&#x521A;&#x548C;&#x9759;&#x6001;&#x5F3A;&#x7C7B;&#x578B;&#x610F;&#x601D;&#x76F8;&#x53CD;&#x4E86;&#x3002;&#x3002;&#x6BD4;&#x8F83;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x5C31;&#x662F;JavaScript, &#x5728; JavaScript &#x4E2D;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x53EA;&#x8981;&#x5230;&#x4E86;&#x6700;&#x7EC8;&#x6267;&#x884C;&#x65F6;&#x624D;&#x77E5;&#x9053;&#x5176;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5E76;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x7684;&#x7ED9;&#x5176;&#x8D4B;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x5728; JavaScript &#x8FD9;&#x79CD;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#x662F;&#x88AB;&#x5141;&#x8BB8;&#x7684;&#x3002;&#x5E76;&#x4E14; JavaScript &#x4E5F;&#x662F;&#x8DB3;&#x591F;&#x667A;&#x80FD;&#x53EF;&#x4EE5;&#x77E5;&#x9053;/&#x89E3;&#x91CA;&#x4F60;&#x8981;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x9020;&#x6210;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x4E0B;&#x964D;&#xFF0C;&#x56E0;&#x6B64;&#x624D;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;&#x5F31;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x3002;</p>
<hr>

<h1 id="&#x4EC0;&#x4E48;&#x662F;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF1F;typescript-&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF1F;TypeScript &#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#xFF1F;</h1>
<p>JavaScript &#x662F;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x7528; JavaScript &#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x77E5;&#x9053;&#x53D8;&#x91CF;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x76F4;&#x5230;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x4E3A;&#x8BE5;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x503C;&#x3002; &#x53EF;&#x4EE5;&#x5C06;&#x53D8;&#x91CF;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x6216;&#x5F3A;&#x5236;&#x4E3A;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x6216;&#x8B66;&#x544A;&#x3002; &#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7ECF;&#x5E38;&#x5FFD;&#x7565;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5927;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;TypeScript &#x4F7F;&#x7528;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x3002;&#x5B83;&#x662F;JavaScript&#x7684;&#x8D85;&#x96C6;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x9009;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x548C;&#x53EF;&#x9760;&#x7684;&#x5DE5;&#x5177;&#x3002; &#x58F0;&#x660E;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x5176;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#x3002; TypeScript &#x5C06;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x68C0;&#x67E5;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x53D8;&#x91CF;&#x88AB;&#x8D4B;&#x4E88;&#x4E86;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x5219;&#x4F1A;&#x5F15;&#x53D1;&#x9519;&#x8BEF; &#x2014;&#x2014; TypeScript&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x62A5;&#x544A;&#x4F60;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x95EE;&#x9898;  &#x5B83;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x4EE3;&#x7801;&#x6765;&#x907F;&#x514D;&#x7F16;&#x5199;JavaScript&#x65F6;&#x7ECF;&#x5E38;&#x9047;&#x5230;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x3002; </p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8BE5;&#x9519;&#x8BEF;&#x4E0D;&#x4F1A;&#x963B;&#x6B62;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x3002; &#x8BE5;&#x4EE3;&#x7801;&#x4ECD;&#x5C06;&#x7F16;&#x8BD1;&#x4E3A;&#x7EAF; JavaScript &#x5E76;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002; &#x8FD9;&#x6837;&#xFF0C;TypeScript &#x6709;&#x70B9;&#x50CF;&#x5BF9;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x201C;&#x62FC;&#x5199;&#x68C0;&#x67E5;&#x201D;&#x3002; &#x5B83;&#x4F1A;&#x5728;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#x901A;&#x77E5;&#x60A8;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x66F4;&#x6539;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x9759;&#x6001;&#x7C7B;&#x578B;&#x5728; TypeScript &#x4E2D;&#x662F;&#x53EF;&#x9009;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x4E3A;&#x53D8;&#x91CF;&#x6307;&#x5B9A; <code>any</code> &#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F; &#x200B;&#x200B; &#x5176;&#x503C;&#x6210;&#x4E3A;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x3002;&#x5982;&#x679C;&#x672A;&#x6307;&#x5B9A;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x5C06;&#x7C7B;&#x578B;&#x8BBE;&#x7F6E;&#x4E3A; <code>any</code> &#x7C7B;&#x578B;&#x3002;</p>
<h2 id="&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;">&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;</h2>
<p>&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x53EF;&#x9009;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;TypeScript&#x8BD5;&#x56FE;&#x5C06;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x70B9;&#x5E26;&#x5165;&#x52A8;&#x6001;&#x7684;JavaScript&#x4E16;&#x754C;&#x3002;&#x8FD9;&#x4E9B;&#x597D;&#x5904;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li><p>&#x4F7F;&#x7F16;&#x5199;&#x6B63;&#x786E;&#x548C;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#xFF0C;&#x4ECE;&#x800C;&#x6D88;&#x9664;&#x4E86;&#x5E38;&#x89C1;&#x9519;&#x8BEF;&#xFF0C;&#x5982;&#x9519;&#x522B;&#x5B57;&#x6216;&#x5BF9;&#x67D0;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x7684;&#x9519;&#x8BEF;&#x5047;&#x8BBE;&#x3002; &#x4E0E;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x76F8;&#x53CD;&#xFF0C;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x7531;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x6355;&#x83B7;&#x7684;&#xFF0C;&#x800C;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x901A;&#x5E38;&#x9700;&#x8981;&#x7F16;&#x5199;&#x66F4;&#x591A;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x6765;&#x6DB5;&#x76D6;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x7528;TypeScript&#x7F16;&#x5199;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002; &#x8FD9;&#x53EA;&#x662F;&#x610F;&#x5473;&#x7740;&#x5B83;&#x9700;&#x8981;&#x7684;&#x6570;&#x91CF;&#x66F4;&#x5C11;&#x3002;</p>
</li>
<li><p>&#x6709;&#x4E86;&#x6709;&#x5173;&#x7C7B;&#x578B;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;IDE&#x4F1A;&#x63D0;&#x4F9B;&#x5F88;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x529F;&#x80FD;&#x3002; &#x8FD9;&#x4F7F;API&#x66F4;&#x5177;&#x53EF;&#x53D1;&#x73B0;&#x6027;&#xFF0C;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x5FC5;&#x59CB;&#x7EC8;&#x68C0;&#x67E5;API&#x53C2;&#x8003;&#x6216;&#x5B8C;&#x5168;&#x4E86;&#x89E3;&#x6240;&#x6709;API&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002; &#x8FD9;&#x901A;&#x5E38;&#x4F1A;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x751F;&#x4EA7;&#x7387;&#x3002;</p>
</li>
<li><p>&#x5B83;&#x4F7F;&#x6267;&#x884C;&#x81EA;&#x52A8;&#x548C;&#x5B89;&#x5168;&#x7684;&#x4EE3;&#x7801;&#x91CD;&#x6784;&#xFF08;&#x5982;&#x91CD;&#x547D;&#x540D;&#x529F;&#x80FD;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002; &#x8FD9;&#x79CD;&#x5DE5;&#x5177;&#x652F;&#x6301;&#x4EE5;&#x53CA;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x6D4F;&#x89C8;&#x4EE3;&#x7801;&#x7684;&#x80FD;&#x529B;&#xFF08;&#x5177;&#x6709;&#x201C;&#x8F6C;&#x5230;&#x5B9A;&#x4E49;&#x201D;&#x548C;&#x201C;&#x67E5;&#x627E;&#x6240;&#x6709;&#x5F15;&#x7528;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x529F;&#x80FD;&#xFF09;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x5927;&#x578B;&#x4EE3;&#x7801;&#x5E93;&#x5E76;&#x5C06;&#x5176;&#x4FDD;&#x6301;&#x5728;&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
</li>
</ul>
<p>TypeScript&#x5F15;&#x5165;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x8DB3;&#x591F;&#x7075;&#x6D3B;&#xFF0C;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x5927;&#x591A;&#x6570;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;JavaScript&#x6A21;&#x5F0F;&#x3002; &#x5C06;&#x8BE5;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E0E;&#x4E3B;&#x6D41;&#x7684;&#x4E25;&#x683C;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF08;&#x5982;Java&#x6216;C&#xFF03;&#xFF09;&#x4E2D;&#x7684;&#x90A3;&#x4E9B;&#x533A;&#x522B;&#x7684;&#x6700;&#x5927;&#x56E0;&#x7D20;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x201C;&#x7ED3;&#x6784;&#x5B50;&#x7C7B;&#x578B;&#x201D;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x201C;&#x9E2D;&#x5B50;&#x7C7B;&#x578B;&#x201D;&#x3002; &#x6709;&#x5173;&#x8BE5;&#x4E3B;&#x9898;&#x7684;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;<a href="https://github.com/Microsoft/TypeScript/wiki/Type%20Compatibility" target="_blank">&#x6B64;&#x5904;</a>&#x3002; &#x5176;&#x4ED6;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x529F;&#x80FD;&#x5305;&#x62EC;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x548C;&#x6CDB;&#x578B;&#x652F;&#x6301;&#x3002;</p>
<hr>

<h1 id="&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;-typescript">&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9; TypeScript</h1>
<blockquote>
<p>JavaScript&#x8FDC;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x529F;&#x80FD;&#x548C;&#x602A;&#x5F02;&#x4E4B;&#x5904;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x96BE;&#x6784;&#x5EFA;&#x5927;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF1A;</p>
</blockquote>
<ul>
<li>&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x5C31;&#x4F1A;&#x5728;&#x5168;&#x5C40;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x3002;</li>
<li>&#x201C;==&#x201D; &#x9020;&#x6210;&#x7684;&#x5F3A;&#x5236;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002;</li>
<li>this&#x6307;&#x5411;&#x95EE;&#x9898;&#xFF1B;</li>
</ul>
<p>&#x4EE5;&#x4E0A;&#x4E09;&#x70B9;&#x5728; JavaScript &#x4EE3;&#x7801;&#x4E2D;&#x968F;&#x5904;&#x53EF;&#x89C1;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x884C;&#x4E3A;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x6DF7;&#x4E71;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x800C;&#x4E14;&#xFF0C;JavaScript&#x662F;&#x4E00;&#x79CD;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x4E0D;&#x5177;&#x6709;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x7EE7;&#x627F;&#xFF0C;&#x56E0;&#x6B64;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;&#x7EE7;&#x627F;&#x3002; &#x867D;&#x7136;&#x539F;&#x578B;&#x7EE7;&#x627F;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x574F;&#x4E8B;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x6765;&#x81EA;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x80CC;&#x666F;&#xFF08;&#x4F8B;&#x5982;Java&#x6216;C&#xFF03;&#xFF09;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x7EE7;&#x627F;&#x5C31;&#x4E0D;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x4E86;&#x3002; &#x8FD9;&#x4F7F;&#x5F04;&#x6E05;&#x695A;&#x5982;&#x4F55;&#x7EC4;&#x7EC7;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x6216;&#x9690;&#x85CF;&#x67D0;&#x4E9B;&#x5BF9;&#x8C61;&#x6210;&#x5458;&#xFF08;&#x5982;&#x79C1;&#x6709;&#x5B57;&#x6BB5;&#x548C;&#x65B9;&#x6CD5;&#xFF09;&#x53D8;&#x5F97;&#x6709;&#x4E9B;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5F00;&#x53D1;JavaScript&#x662F;&#x552F;&#x4E00;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5B83;&#x662F;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x666E;&#x904D;&#x652F;&#x6301;&#x7684;&#x552F;&#x4E00;&#x5BA2;&#x6237;&#x7AEF;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x968F;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5730;&#x5C06;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x89C6;&#x4E3A;&#x4E00;&#x79CD;&#x5206;&#x53D1;&#x6A21;&#x578B;&#xFF08;distribution model&#xFF09;&#xFF0C;&#x8BE5;&#x5206;&#x53D1;&#x6A21;&#x578B;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x5151;&#x73B0;&#x201C;&#x7F16;&#x5199;&#x4E00;&#x6B21;&#xFF0C;&#x968F;&#x5904;&#x8FD0;&#x884C;&#xFF08;write once, run everywhere&#xFF09;&#x201D;&#x7684;&#x627F;&#x8BFA;&#xFF0C;&#x73B0;&#x4EE3;&#x5BA2;&#x6237;&#x7AEF;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x590D;&#x6742;&#x6027;&#x660E;&#x663E;&#x8D85;&#x8FC7;&#x4E86;JavaScript&#x7684;&#x529F;&#x80FD;&#x3002; &#xFF08;&#x81F3;&#x5C11;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#xFF09;&#x7528;&#x66F4;&#x9002;&#x5408;&#x7684;&#x8BED;&#x8A00;&#x66FF;&#x6362;JavaScript&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5F88;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x8BF4;&#x670D;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x4F9B;&#x5E94;&#x5546;&#x666E;&#x904D;&#x540C;&#x610F;&#x5E76;&#x91C7;&#x7528;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x6311;&#x6218;&#x3002; &#x8FD9;&#x79CD;&#x8BA4;&#x8BC6;&#x4FC3;&#x4F7F;&#x4E0D;&#x540C;&#x7684;&#x5C0F;&#x7EC4;&#x5F00;&#x53D1;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;JavaScript&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#x73B0;&#x6709;&#x6216;&#x5168;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#x3002; &#x5176;&#x4E2D;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>Google&#x2019;s <a href="http://en.wikipedia.org/wiki/Google_Web_Toolkit" target="_blank">GWT</a> and <a href="http://en.wikipedia.org/wiki/Dart_(programming_language" target="_blank">Dart</a>)</li>
<li><a href="http://en.wikipedia.org/wiki/CoffeeScript" target="_blank">CoffeeScript</a></li>
<li><p>Microsoft&#x2019;s <a href="http://www.typescriptlang.org/" target="_blank">TypeScript</a></p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848; <a href="http://www.hanselman.com/blog/JavaScriptIsWebAssemblyLanguageAndThatsOK.aspx" target="_blank">&#x5C06;JavaScript&#x89C6;&#x4E3A;Web&#x7684;&#x6C47;&#x7F16;&#x8BED;&#x8A00;</a>&#x3002;</p>
</li>
</ul>
<p>TypeScript&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;JavaScript&#x7684;&#x4E25;&#x683C;&#x8D85;&#x96C6;&#xFF0C;&#x5B83;&#x6DFB;&#x52A0;&#x4E86;&#x53EF;&#x9009;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x548C;&#x7B26;&#x5408; ES6 &#x6807;&#x51C6;&#x5EFA;&#x8BAE;&#x7684;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x3002; &#x5B83;&#x88AB;&#x7F16;&#x8BD1;&#x4E3A;&#x60EF;&#x7528;&#x7684;JavaScript&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x5E93;&#x6765;&#x652F;&#x6301;&#x5B83;&#x3002;&#x8FD9;&#x6BB5;&#x8BDD;&#x7684;&#x610F;&#x601D;&#x4F53;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;TypeScript&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#xFF0C;&#x5373;&#xFF1A; </p>
<ul>
<li>&#x9759;&#x6001;&#x8BC6;&#x522B;&#x53EF;&#x80FD;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x6784;&#x9020; </li>
<li>&#x4E3A;&#x8F83;&#x5927;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x63D0;&#x4F9B;&#x7ED3;&#x6784;&#x5316;&#x673A;&#x5236;</li>
</ul>
<h2 id="&#x4F18;&#x70B9;&#xFF1A;">&#x4F18;&#x70B9;&#xFF1A;</h2>
<p><img src="../asserts/imgs/03.png" alt=""></p>
<ul>
<li>Early Detection of Errors &#x53CA;&#x65E9;&#x53D1;&#x73B0;&#x9519;&#x8BEF;</li>
<li>Improves Code Readability &#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x53EF;&#x8BFB;&#x6027;</li>
<li>Promotes Dependable Refactoring &#x4FC3;&#x8FDB;&#x53EF;&#x9760;&#x7684;&#x91CD;&#x6784;</li>
<li>Improved IDE Support &#x6539;&#x8FDB;&#x7684; IDE &#x652F;&#x6301;</li>
<li>Easy Code Analysis &#x7B80;&#x6613;&#x4EE3;&#x7801;&#x5206;&#x6790;</li>
</ul>
<h2 id="&#x7F3A;&#x70B9;&#xFF1A;">&#x7F3A;&#x70B9;&#xFF1A;</h2>
<p>&#x4EFB;&#x4F55;&#x4E8B;&#x7269;&#x90FD;&#x662F;&#x6709;&#x4E24;&#x9762;&#x6027;&#x7684;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A; TypeScript &#x7684;&#x5F0A;&#x7AEF;&#x5728;&#x4E8E;&#xFF1A;</p>
<ul>
<li>&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5B66;&#x4E60;&#x6210;&#x672C;&#xFF0C;&#x9700;&#x8981;&#x7406;&#x89E3;&#x63A5;&#x53E3;&#xFF08;Interfaces&#xFF09;&#x3001;&#x6CDB;&#x578B;&#xFF08;Generics&#xFF09;&#x3001;&#x7C7B;&#xFF08;Classes&#xFF09;&#x3001;&#x679A;&#x4E3E;&#x7C7B;&#x578B;&#xFF08;Enums&#xFF09;&#x7B49;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x6089;&#x7684;&#x6982;&#x5FF5;</li>
<li>&#x77ED;&#x671F;&#x53EF;&#x80FD;&#x4F1A;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x5F00;&#x53D1;&#x6210;&#x672C;&#xFF0C;&#x6BD5;&#x7ADF;&#x8981;&#x591A;&#x5199;&#x4E00;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x4E0D;&#x8FC7;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x957F;&#x671F;&#x7EF4;&#x62A4;&#x7684;&#x9879;&#x76EE;&#xFF0C;TypeScript &#x80FD;&#x591F;&#x51CF;&#x5C11;&#x5176;&#x7EF4;&#x62A4;&#x6210;&#x672C;</li>
<li>&#x96C6;&#x6210;&#x5230;&#x6784;&#x5EFA;&#x6D41;&#x7A0B;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x91CF;</li>
<li>&#x53EF;&#x80FD;&#x548C;&#x4E00;&#x4E9B;&#x5E93;&#x7ED3;&#x5408;&#x7684;&#x4E0D;&#x662F;&#x5F88;&#x5B8C;&#x7F8E;</li>
<li>&#x5BF9;&#x4E8E;&#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x80CC;&#x666F;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C; &#x9700;&#x8981;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x6CE8;&#x91CA;&#xFF0C;&#x8FD9;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x5F88;&#x9EBB;&#x70E6;&#x3002;</li>
<li>&#x6709;&#x65F6;&#x5728;&#x4F7F;&#x7528;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x65F6;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x58F0;&#x660E;&#x6587;&#x4EF6;&#xFF08;.d.ts&#xFF09; &#x6216;&#x9047;&#x5230;&#x7B2C;&#x4E09;&#x65B9;&#x6A21;&#x5757;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x6587;&#x4EF6;&#x5B58;&#x5728;&#x8D28;&#x91CF;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x90FD;&#x4F1A;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A; block &#x5F00;&#x53D1;&#x7684;&#x8FDB;&#x5EA6;&#x3002;</li>
<li>&#x7531;&#x4E8E;&#x4EFB;&#x4F55;JavaScript&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;TypeScript&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x6B64;TypeScript&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;JavaScript&#x95EE;&#x9898;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x79CD;&#x5E7B;&#x60F3;&#xFF1A;&#x5B83;&#x4F1A;&#x901A;&#x8FC7;&#x7ED9;&#x51FA;&#x5B89;&#x5168;&#x6027;&#x5E7B;&#x60F3;&#x800C;&#x5F15;&#x8D77;&#x66F4;&#x591A;&#x7684;&#x6DF7;&#x4E71;&#x3002;
&#x6269;&#x3002;</li>
</ul>
<p>&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x56E2;&#x961F;&#x548C;&#x9879;&#x76EE;&#x7684;&#x60C5;&#x51B5;&#x5224;&#x65AD;&#x662F;&#x5426;&#x9700;&#x8981;&#x4F7F;&#x7528; TypeScript&#x3002;</p>
<hr>

<h1 id="typescript-&#x548C;-javascript-&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF1F;">TypeScript &#x548C; JavaScript &#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF1F;</h1>
<table>
<thead>
<tr>
<th style="text-align:left"></th>
<th style="text-align:left">JavaScript</th>
<th style="text-align:left">TypeScript</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">1</td>
<td style="text-align:left">&#x7531;&#x7F51;&#x666F;&#x516C;&#x53F8;&#x5728; 1995 &#x5E74;&#x5F00;&#x53D1;&#x7684;&#x3002;</td>
<td style="text-align:left">&#x7531;&#x5FAE;&#x8F6F;&#x4E8E;2012&#x53D1;&#x5E03;</td>
</tr>
<tr>
<td style="text-align:left">2</td>
<td style="text-align:left">&#x6587;&#x4EF6;&#x4EE5;&#x201D;.js&#x201D;&#x540E;&#x7F00;</td>
<td style="text-align:left">&#x6587;&#x4EF6;&#x662F;&#x4EE5;&#x201D;.ts&#x201D;&#x540E;&#x7F00;</td>
</tr>
<tr>
<td style="text-align:left">3</td>
<td style="text-align:left">&#x4E0D;&#x652F;&#x6301; ES6</td>
<td style="text-align:left">&#x652F;&#x6301; ES6</td>
</tr>
<tr>
<td style="text-align:left">4</td>
<td style="text-align:left">&#x4E0D;&#x652F;&#x6301;&#x5F3A;&#x7C7B;&#x578B;&#x6216;&#x9759;&#x6001;&#x7C7B;&#x578B;</td>
<td style="text-align:left">&#x652F;&#x6301;&#x5F3A;&#x7C7B;&#x578B;&#x6216;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7279;&#x6027;</td>
</tr>
<tr>
<td style="text-align:left">5</td>
<td style="text-align:left">&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x811A;&#x672C;&#x8BED;&#x8A00;</td>
<td style="text-align:left">&#x5B83;&#x652F;&#x6301;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x6982;&#x5FF5;&#xFF0C;&#x5982;&#x7C7B;&#x3001;&#x63A5;&#x53E3;&#x3001;&#x7EE7;&#x627F;&#x3001;&#x6CDB;&#x578B;&#x7B49;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">6</td>
<td style="text-align:left">&#x6CA1;&#x6709;&#x53EF;&#x9009;&#x7684;&#x53C2;&#x6570;&#x7279;&#x6027;&#x3002;</td>
<td style="text-align:left">&#x6709;&#x53EF;&#x9009;&#x7684;&#x53C2;&#x6570;&#x7279;&#x6027;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">7</td>
<td style="text-align:left">&#x5B83;&#x662F;&#x89E3;&#x91CA;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x7A81;&#x51FA;&#x663E;&#x793A;&#x9519;&#x8BEF;&#x3002;</td>
<td style="text-align:left">&#x5B83;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#x5E76;&#x5728;&#x5F00;&#x53D1;&#x671F;&#x95F4;&#x7A81;&#x51FA;&#x663E;&#x793A;&#x9519;&#x8BEF;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">8</td>
<td style="text-align:left">&#x4E0D;&#x652F;&#x6301;&#x6A21;&#x5757;&#x3002;</td>
<td style="text-align:left">&#x652F;&#x6301;&#x6A21;&#x5757;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">9</td>
<td style="text-align:left">&#x5728;&#x8FD9;&#x91CC;&#xFF0C;number &#x548C; string &#x662F;&#x5BF9;&#x8C61;&#x3002;</td>
<td style="text-align:left">&#x5728;&#x8FD9;&#x91CC;&#xFF0C;number &#x548C; string &#x662F;&#x63A5;&#x53E3;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">10</td>
<td style="text-align:left">JavaScript &#x4E0D;&#x652F;&#x6301;&#x6CDB;&#x578B;&#x3002;</td>
<td style="text-align:left">TypeScript &#x652F;&#x6301;&#x6CDB;&#x578B;&#x3002;</td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ben-di-kai-fa-huan-jing-da-jian.html" class="navigation navigation-next " aria-label="Next page: 本地开发环境搭建">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"什么是TypeScript","level":"2.1","depth":1,"next":{"title":"本地开发环境搭建","level":"2.2","depth":1,"path":"ji-chu/ben-di-kai-fa-huan-jing-da-jian.md","ref":"ji-chu/ben-di-kai-fa-huan-jing-da-jian.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["highlight","-search","theme-comscore","-anchor-navigation-ex-toc","fontsettings","sharing","search-plus","intopic-toc"],"root":".","styles":{"website":"./styles/website.css"},"pluginsConfig":{"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":true},"intopic-toc":{"selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","mode":"nested","maxDepth":4,"isCollapsed":false,"isScrollspyActive":true,"visible":true,"label":{"en":"In this article"}},"highlight":{},"fontsettings":{"theme":"white","family":"sans","size":2},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"search-plus":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"theme-comscore":{}},"theme":"default","author":"G-Dragon","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"TypeSctipt 学习笔记","language":"zh-hans","gitbook":">=3.0.0","description":""},"file":{"path":"ji-chu/shen-me-shi-typescript.md","mtime":"2020-08-06T15:04:26.002Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-08-09T13:10:28.469Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

